#https://programforyou.ru/block-diagram-redactor
# Пользователь вводит с клавиатуры номер месяца программа выводит на экран надпись: Winter (если введено
# значение 1,2 или 12), Spring (если введено значение от 3
# до 5), Summer (если введено значение от 6 до 8), Autumn
# (если введено значение от 9 до 11).
# Если пользователь ввел значение не в диапазоне от 1
# до 12 требуется вывести сообщение об ошибке.

# x = int(input("Введите число месяца (от 1 до 12) : "))
# if x == (1 or 2 or 12):
#     print("Зима")
# elif x == (3 or 4 or 5):
#     print("Весна")
# elif x == (6 or 7 or 8):
#     print("Лето")
# else:
#     print("Осень")

# god = int(input("Введите год. Проверим, является ли он високосным:\n"))
# if (god % 4) != 0:
#     print("Год обыкновенный.")
# elif (god % 4) == 0:
#     if (god % 100) != 0:
#         print("Год високосный.")
#     elif (god % 100) == 0:
#         if (god % 400) != 0:
#             print("Год не високосный.")
#         else:
#             print("Год високосный.")

nameGame = "Подземелья"
print("Добро пожаловать \n 'Подземелья'")


print("Выберите пол персонажа:\n", "ж-женский\n", "м-Мужской")
gender = str(input("Введите ж или м :\n"))
if gender == "М" or gender == "м":
  gender = "Мужской"
elif gender == "Ж" or gender == "ж":
  gender = "Женский"
print(f"Вы выбрали {gender} пол")

print("Выберете расу персонажа ч-человек,\n э-эльф")
race = str(input("Введите ч или э:\n"))
if race == "ч" or race == "Ч":
  race = "Человек"
elif race == "э" or race == "Э":
  race = "Эльф"
  
  print(f"Вы выбрали рассу {race}")

if race == "Человек":
  scoreRole = 0  # галочка для выбора класса
  print("Выберете класс:\n", "1-Воин", "2-Лучник", "3-Жрец", "4-Маг")
  role = input("введите 1,2,3 или 4 для выбора класса:")
  if role == "1":
    role = "Воин\n"
  elif role == "2":
    role = "Лучник\n"
  elif role == "3":
    role = "Жрец\n"
  elif role == "4":
    role = "Маг\n"

elif race == "Эльф":
    print("Выберете класс:\n", "1-Воин\n", "2-Лучник\n", "3-Темный Колдун\n",
          "4-Паладин\n")
    role = input("введите 1,2,3 или 4 для выбора класса")
    if role == "1":
      role = "Воин"
    elif role == "2":
      role = "Лучник"
    elif role == "3":
      role = "Темный Колдун"
    elif role == "4":
      role = "Паладин"
print(f"Вы выбрали класс:{role}")

name = str(input("Введите имя вашего персонажа"))
print("\nИнформация о персонаже:\n"
        f"пол персонажа {gender}\n"
        f"Раса персонажа {race}\n"
        f"Класс:{role}\n"
        f"Имя:{name}\n")




