# Задание 1
# Пользователь вводит с клавиатуры три числа. Необходимо найти сумму чисел, произведение чисел. Результат
# вычислений вывести на экран.

a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
c = int(input("Введите третье число: "))
summa = str(a+b+c)
proizv = str(a*b*c)
print()
print("Сумма введённых чисел равна:" + " " + summa)
print("Произведение введённых чисел равно:" + " " + proizv)
