# Задание 5
# Выведите на экран надпись «Life is what happens when
# you're busy making other plans» John Lennon на разных
# строках. Пример вывода:
# “Life is what happens
#  when
#  you’re busy making other plans”
#  John Lennon

print('"Life is what happens\n      when\n\t  you’re busy making other plans"\n\t\t\t\t      John Lennon.')